0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            prghTotalPressure;
        p0              uniform 100000;
        value           uniform 100000;
    }
    morimoto
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
    outlet
    {
        type            prghTotalPressure;
        p0              uniform 100000;
        value           uniform 100000;
    }
    walls
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 100000;
    }
}


// ************************************************************************* //
