constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          992;
        startFace       184883;
    }
    morimoto
    {
        type            wall;
        inGroups        1(wall);
        nFaces          924;
        startFace       185875;
    }
    outlet
    {
        type            patch;
        nFaces          4142;
        startFace       186799;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6712;
        startFace       190941;
    }
)

// ************************************************************************* //
